Белгипрозем_2017/src/Documents/мВзаимозачет/мВзаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мВзаимозачет</name>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентДеб</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорДеб</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговораДеб</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентКре</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКре</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговораКре</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимозачета</name>
    <type>
      <types>EnumRef.мВидыВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/мДатыДоговоров/мДатыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мДатыДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмОснование</name>
    <comment>Промежуточный</comment>
    <type>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДатыДоговора</name>
    <type>
      <types>CatalogRef.мВидыДатДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.мВнесениеДатыРешения</types>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.мАктирование</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.мВзаимозачет</types>
      <types>DocumentRef.мПродлениеСроков</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/мВидыВзаимозачета/мВидыВзаимозачета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мВидыВзаимозачета</name>
  <enumValues>
    <name>МеждуКорреспондентами</name>
  </enumValues>
  <enumValues>
    <name>МеждуДоговорами</name>
  </enumValues>
  <enumValues>
    <name>МеждуЭтапамиДоговоров</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/ВидыВнутреннихДокументов/ВидыВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВнутреннихДокументов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДоговораЗемлеустроительныхРабот</name>
      <description>Договора землеустроительных работ</description>
    </items>
    <items>
      <name>ДокументыТехархива</name>
      <description>Документы техархива</description>
    </items>
    <items>
      <name>ДопСоглашения</name>
      <description>Дополнительные соглашения</description>
    </items>
    <items>
      <name>АктВыбора</name>
      <description>Акт выбора</description>
    </items>
    <items>
      <name>АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Дело</name>
      <description>Дело</description>
    </items>
    <items>
      <name>ДелоУслуги</name>
      <description>Дело-услуги</description>
    </items>
    <items>
      <name>Нормализация</name>
      <description>Нормализация</description>
    </items>
  </predefined>
  <attributes>
    <name>АвтоматическиВестиСоставУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоАдресатам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоКорреспондентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСтатьямДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключенУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьСозданиеДокументовНеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭтапыОбработкиДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаПечатьШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенФайлОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеРабочихГруппДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеУказаниеОтветственного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьРезолюцииЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНедействующиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСрокДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСуммуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоговором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКомплектомДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДопСоглашением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/мВзаимозачет/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Объект.Ссылка.Пустая() Тогда
        Объект.Ответственный = 	Пользователи.ТекущийПользователь();
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКорреспондентКредит(Команда)
    Объект.КорреспондентКре = Объект.КорреспондентДеб;
    УстановитьВидВзаимозачета();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговорКредит(Команда)
    Объект.КорреспондентКре = Объект.КорреспондентДеб;
    Объект.ДоговорКре = Объект.ДоговорДеб;
    УстановитьВидВзаимозачета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
    РеквизитыДокОснования = ОснованиеПриИзмененииНаСервере(Объект.Основание);
     
    Объект.НомерДокумента = РеквизитыДокОснования.Номер; 
    Объект.ДатаДокумента = РеквизитыДокОснования.Дата; 
КонецПроцедуры

&НаКлиенте
Процедура КорреспондентДебПриИзменении(Элемент)
    УстановитьВидВзаимозачета();
КонецПроцедуры

&НаКлиенте
Процедура КорреспондентКреПриИзменении(Элемент)
    УстановитьВидВзаимозачета();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорДебПриИзменении(Элемент)
    УстановитьВидВзаимозачета();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКреПриИзменении(Элемент)
    УстановитьВидВзаимозачета();
КонецПроцедуры

&НаСервереБезКонтекста
Функция КорреспондентДоговора(Договор)
	Возврат Договор.Корреспондент;	
КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОснованиеПриИзмененииНаСервере(Основание)
    СтруктураРеквизитов = Новый Структура("Номер, Дата");
    Если ЗначениеЗаполнено(Основание) Тогда
        СтруктураРеквизитов.Вставить("Номер", Основание.ИсходящийНомер);
        СтруктураРеквизитов.Вставить("Дата", Основание.ИсходящаяДата);
    КонецЕсли; 
    Возврат СтруктураРеквизитов;
КонецФункции

&НаСервере
Процедура УстановитьВидВзаимозачета()
    Если Объект.КорреспондентДеб <> Объект.КорреспондентКре Тогда
        Объект.ВидВзаимозачета = Перечисления.мВидыВзаимозачета.МеждуКорреспондентами;
        
    ИначеЕсли Объект.ДоговорДеб <> Объект.ДоговорКре Тогда
        Объект.ВидВзаимозачета = Перечисления.мВидыВзаимозачета.МеждуДоговорами;
        
    Иначе
        Объект.ВидВзаимозачета = Перечисления.мВидыВзаимозачета.МеждуЭтапамиДоговоров;
    КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    
    // Расчет и запись плановых сроков по этапам взаимозачета
    Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
        
        ВидДатыПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
        
        ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(ТекущийОбъект.ЭтапДоговораДеб, , Ложь);
		Если ПлановыйСрок <> Неопределено Тогда
           
            НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
            
            НаборЗаписей.Отбор.Основание.Установить(ТекущийОбъект.Ссылка);
            НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыПлановыйСрок);
            НаборЗаписей.Отбор.ЭтапДоговора.Установить(ТекущийОбъект.ЭтапДоговораДеб);
            
            НоваяЗапись = НаборЗаписей.Добавить();
            НоваяЗапись.Период = ТекущаяДата();
            НоваяЗапись.ВидДатыДоговора = ВидДатыПлановыйСрок;
            НоваяЗапись.ЭтапДоговора = ТекущийОбъект.ЭтапДоговораДеб;
            НоваяЗапись.Основание = ТекущийОбъект.Ссылка;
            НоваяЗапись.Дата = ПлановыйСрок;
            НоваяЗапись.Комментарий = ТекущийОбъект.Комментарий;
            НоваяЗапись.Установил = Пользователи.ТекущийПользователь();
			
            НаборЗаписей.Записать(Истина);
        КонецЕсли; 
        
        ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(ТекущийОбъект.ЭтапДоговораКре, , Ложь);
		Если ПлановыйСрок <> Неопределено Тогда
            
            НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
            
            НаборЗаписей.Отбор.Основание.Установить(ТекущийОбъект.Ссылка);
            НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыПлановыйСрок);
            НаборЗаписей.Отбор.ЭтапДоговора.Установить(ТекущийОбъект.ЭтапДоговораКре);
            
            НоваяЗапись = НаборЗаписей.Добавить();
            НоваяЗапись.Период = ТекущаяДата();
            НоваяЗапись.ВидДатыДоговора = ВидДатыПлановыйСрок;
            НоваяЗапись.ЭтапДоговора = ТекущийОбъект.ЭтапДоговораКре;
            НоваяЗапись.Основание = ТекущийОбъект.Ссылка;
            НоваяЗапись.Дата = ПлановыйСрок;
            НоваяЗапись.Комментарий = ТекущийОбъект.Комментарий;
            НоваяЗапись.Установил = Пользователи.ТекущийПользователь();
            
            НаборЗаписей.Записать(Истина);
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДоговорДебНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(Объект.КорреспондентДеб) Тогда
		СписокНайденных = ПолучитьСписокДоговоровКорреспондента(Объект.КорреспондентДеб);
        Если СписокНайденных.Количество() = 1 Тогда
            Объект.ДоговорДеб = СписокНайденных.Получить(0).Значение; 
            
        ИначеЕсли СписокНайденных.Количество() > 1 Тогда
            
            ВыбЭлемент = СписокНайденных.ВыбратьЭлемент(,);
            Если ВыбЭлемент = Неопределено Тогда
                Возврат;
            КонецЕсли;
            
            Объект.ДоговорДеб = ВыбЭлемент.Значение;
        Иначе
            Сообщить("Договоров у "+Объект.КорреспондентДеб+" нет!");
			Объект.ДоговорДеб = Неопределено;
        КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКреНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(Объект.КорреспондентКре) Тогда
		СписокНайденных = ПолучитьСписокДоговоровКорреспондента(Объект.КорреспондентКре);
        Если СписокНайденных.Количество() = 1 Тогда
            Объект.ДоговорКре = СписокНайденных.Получить(0).Значение; 
            
        ИначеЕсли СписокНайденных.Количество() > 1 Тогда
            
            ВыбЭлемент = СписокНайденных.ВыбратьЭлемент(,);
            Если ВыбЭлемент = Неопределено Тогда
                Возврат;
            КонецЕсли;
            
            Объект.ДоговорКре = ВыбЭлемент.Значение;
        Иначе
            Сообщить("Договоров у "+Объект.КорреспондентКре+" нет!");
			Объект.ДоговорКре = Неопределено;
        КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоговоровКорреспондента(Корреспондент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеДокументыКорреспонденты.Ссылка КАК Договор
		|ИЗ
		|	Справочник.ВнутренниеДокументы.Корреспонденты КАК ВнутренниеДокументыКорреспонденты
		|ГДЕ
		|	ВнутренниеДокументыКорреспонденты.Корреспондент = &Корреспондент
		|	И ВнутренниеДокументыКорреспонденты.Ссылка.ВидДокумента В ИЕРАРХИИ(&ВидДокумента)";
	
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.ДоговораЗемлеустроительныхРабот);
	
	Результат = Запрос.Выполнить();
	
	МассивДоговоров = Результат.Выгрузить().ВыгрузитьКолонку("Договор");
	СписокДоговоров = Новый СписокЗначений;
	СписокДоговоров.ЗагрузитьЗначения(МассивДоговоров);
	Возврат СписокДоговоров;	
КонецФункции
#КонецОбласти
